{items: [{
			quote: "Doron Ohel's work was highly professional.  We were both very satisfied.  Doron was very courteous, took time to answer all of our questions, and delivered the material in a timely manner.  Thanks a lot!", 
      initial: "N.T., S.R."
    },{
      quote: "Mr. Ohel was very easy to work with and provided cost effective legal services.", 
      initial: "A.K."
    },{
      quote: "We are very satisfied with the professional service done by Mr. Ohel. Communication was very clear. Instruction on what we need to do further was clear.  We definitely recommend this law office to our friends.", 
      initial: "T.C."
    },{
      quote: "We are glad to have done business with Mr. Ohel. He was very punctual, provided very good service and he was very knowledgeable of what we wanted and gave us advice of additional information. We were both very pleased and are looking forward to doing business in the future.", 
      initial: "J.G."
    },{
      quote: "We would like to thank you for a flawless manner in which you handled our case, and for the fair and honest advise you provided.  We would be more than happy to recommend you to our friends", 
      initial: "R.H.G."
    },{
      quote: "I was impressed with the prompt, professional, and knowledgeable service concerning my estate planning.", 
      initial: "P.D.O."
    },{
      quote: "We were impressed and very satisfied with the prompt and outstanding services provided by the Law Offices of Doron Ohel.  We will not hesitate to use him again or refer friends and family to this office.", 
      initial: "N.F."
    },{
      quote: "I would absolutely recommend Doron Ohel to friends and family.", 
      initial: "A.C."
    },{
      quote: "I am very pleased with Mr. Ohel's professional service to help set up my living trust.", 
      initial: "L.L."
    },{
      quote: "We found Doron Ohel to be a professional, conscientious, and caring attorney.  At a trying time in our lives, he gave us needed peace of mind.", 
      initial: "S.C."
    },{
      quote: "Lawyer Extraordinaire...Doron is very knowledgeable and adept in his field of law. He is highly attentive and responsive to your needs. Doron is honest and will tell you to the best of his ability if something can or cannot be done. My experience with Doron is that he truly cares about his clients and has passion for what he does. It's more than just a career.", 
      initial: "J.D."
    },{
      quote: "My wife and I were very satisfied with the legal service provided on our living trust case.&nbsp;&nbsp;We've referred quite a few friends already and they felt the same way. &nbsp;&nbsp;Thanks!&nbsp;&nbsp;&nbsp;", 
      initial: "B.Y."
    },{
      quote: "I have great confidence in the ability of my attorney. I really enjoyed the experience and felt comfortable in the knowledge that my needs were met in a superior way.", 
      initial: "M.J."
    },{
      quote: "We had been pushing off establishment of a trust for years. The Law Offices of Doron Ohel made the process easy while providing us with thorough care and top quality representation.", 
      initial: "J.H."
    },{
      quote: "Doron was exceedingly easy to work with.  He clearly explained the issues and made me aware of issues of relevance. Above all he was knowledgeable and professional.  I plan on continuing to utilize his services indefinitely.", 
      initial: "C.K."
    },{
      quote: "Mr. Ohel was both professional and personable. I felt he upheld the highest standards of the legal profession.", 
      initial: "R.M."
    },{
      quote: "The extra attention given to every detail of my case contributed to a speedy and favorable outcome. I am grateful to Mr. Ohel not only for resolving my legal issues but also for putting my mind at ease during a very stressful time.", 
      initial: "S.O."
    },{
      quote: "I got a precise answer, which was followed up with more detail. All in all I felt that I received a professional treatment.", 
      initial: "M.S."
    },{
      quote: "Doron was very clear and concise explaining to me the intricacies of a living trust. I would highly recommend his services.", 
      initial: "P.W."
    },{
      quote: "We wanted to thank you for being our first member speaker and for so successfully paving the way. You did a fantastic job on a hard topic to present in 10 minutes. Your presentation was clear, well organized, and very well delivered. We appreciate your efforts.", 
      initial: "Silicom Synergy Board"
    },{
      quote: "Doron is a great lawyer. I think his presentation won my case. Thank you again.", 
      initial: "S.E."
    },{
      quote: "Excellent, prompt and professional service. Doron explained everything up front and carefully walked us through the process, making a somewhat difficult subject, a good experience.", 
      initial: "G.M."
}]}
